espressif/esp-idf/components/soc/esp32h21/register/soc/cache_struct.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: Control and configuration registers */
/** Type of l1_cache_ctrl register
 *  L1 data cache (L1 cache) control register
 */
typedef union {
    struct {
        /** l1_cache_shut_bus0 : R/W; bitpos: [0]; default: 0;
         *  Configures whether to disable BUS0 to access the L1 cache.
         *  0: Enable
         *  1: Disable
         */
        uint32_t l1_cache_shut_bus0:1;
        /** l1_cache_shut_bus1 : R/W; bitpos: [1]; default: 0;
         *  Configures whether to disable BUS1 to access the L1 cache.
         *  0: Enable
         *  1: Disable
         */
        uint32_t l1_cache_shut_bus1:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} cache_l1_cache_ctrl_reg_t;


/** Group: Cache Mode Control and configuration registers */
/** Type of l1_cache_cachesize_conf register
 *  Cache size register
 */
typedef union {
    struct {
        uint32_t reserved_0:6;
        /** l1_cache_cachesize_16k : RO; bitpos: [6]; default: 1;
         *  Represents the cache size is 16 KB.
         */
        uint32_t l1_cache_cachesize_16k:1;
        uint32_t reserved_7:25;
    };
    uint32_t val;
} cache_l1_cache_cachesize_conf_reg_t;

/** Type of l1_cache_blocksize_conf register
 *  Cache block size register
 */
typedef union {
    struct {
        uint32_t reserved_0:2;
        /** l1_cache_blocksize_32 : RO; bitpos: [2]; default: 1;
         *  Represents the cache block size is 32 bytes.
         */
        uint32_t l1_cache_blocksize_32:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} cache_l1_cache_blocksize_conf_reg_t;


/** Group: Control Registers */
/** Type of l1_cache_wrap_around_ctrl register
 *  Cache critical word first control register
 */
typedef union {
    struct {
        uint32_t reserved_0:4;
        /** l1_cache_wrap : R/W; bitpos: [4]; default: 0;
         *  Configures whether to enable the critical word first mode for the L1 cache.
         *  0: Disable
         *  1: Enable
         */
        uint32_t l1_cache_wrap:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} cache_l1_cache_wrap_around_ctrl_reg_t;

/** Type of l1_cache_miss_access_ctrl register
 *  Early start configuration register
 */
typedef union {
    struct {
        uint32_t reserved_0:4;
        /** l1_cache_miss_disable_access : R/W; bitpos: [4]; default: 0;
         *  Configure whether to disable the early start function of L1 cache.
         *  0: Enable
         *  1: Disable
         */
        uint32_t l1_cache_miss_disable_access:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} cache_l1_cache_miss_access_ctrl_reg_t;


/** Group: Cache Freeze Control Register */
/** Type of l1_cache_freeze_ctrl register
 *  Cache freeze control register
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** l1_cache_freeze_en : R/W; bitpos: [16]; default: 0;
         *  Configures whether to enable freeze operation in the L1 cache. It can be cleared by
         *  software.
         *  0: Disable
         *  1: Enable
         */
        uint32_t l1_cache_freeze_en:1;
        /** l1_cache_freeze_mode : R/W; bitpos: [17]; default: 0;
         *  Configures the freeze mode in the L1 cache.
         *  0: If a read hits, the data is returned; if a write hits, the cache is updated; if
         *  a miss occurs, the access is not responded to.
         *  1: All accesses are responded to directly; for reads, zero is returned, and for
         *  writes, the cache is not updated.
         */
        uint32_t l1_cache_freeze_mode:1;
        /** l1_cache_freeze_done : RO; bitpos: [18]; default: 0;
         *  Represents whether the freeze operation in L1 cache is finished.
         *  0: Not finished
         *  1: Finished
         */
        uint32_t l1_cache_freeze_done:1;
        uint32_t reserved_19:13;
    };
    uint32_t val;
} cache_l1_cache_freeze_ctrl_reg_t;


/** Group: Cache Memory Access Control and Configuration Registers */
/** Type of l1_cache_data_mem_acs_conf register
 *  Cache data memory access configuration register
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** l1_cache_data_mem_rd_en : R/W; bitpos: [16]; default: 0;
         *  Configures whether to enable the configuration bus to read the L1 cache data memory.
         *  0: Disable
         *  1: Enable
         */
        uint32_t l1_cache_data_mem_rd_en:1;
        /** l1_cache_data_mem_wr_en : R/W; bitpos: [17]; default: 0;
         *  Configures whether to enable the configuration bus to write the L1 cache data
         *  memory.
         *  0: Disable
         *  1: Enable
         */
        uint32_t l1_cache_data_mem_wr_en:1;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} cache_l1_cache_data_mem_acs_conf_reg_t;

/** Type of l1_cache_tag_mem_acs_conf register
 *  Cache tag memory access configuration register
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** l1_cache_tag_mem_rd_en : R/W; bitpos: [16]; default: 0;
         *  Configures whether to enable the configuration bus to read the L1 cache tag memory.
         *  0: Disable
         *  1: Enable
         */
        uint32_t l1_cache_tag_mem_rd_en:1;
        /** l1_cache_tag_mem_wr_en : R/W; bitpos: [17]; default: 0;
         *  Configures whether to enable the configuration bus to write the L1 cache tag memory.
         *  0: Disable
         *  1: Enable
         */
        uint32_t l1_cache_tag_mem_wr_en:1;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} cache_l1_cache_tag_mem_acs_conf_reg_t;


/** Group: Prelock Control and configuration registers */
/** Type of l1_cache_prelock_conf register
 *  L1 cache prelocking configuration register
 */
typedef union {
    struct {
        /** l1_cache_prelock_sct0_en : R/W; bitpos: [0]; default: 0;
         *  Configures whether to enable the prelocking function in Section 0 of the L1 cache.
         *  0: Disable
         *  1: Enable
         */
        uint32_t l1_cache_prelock_sct0_en:1;
        /** l1_cache_prelock_sct1_en : R/W; bitpos: [1]; default: 0;
         *  Configures whether to enable the prelocking function in Section 1 of the L1 cache.
         *  0: Disable
         *  1: Enable
         */
        uint32_t l1_cache_prelock_sct1_en:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} cache_l1_cache_prelock_conf_reg_t;

