espressif/esp-idf/components/soc/esp32h21/register/soc/cache_struct.h
/** Type of l1_cache_prelock_sct0_addr register
 *  L1 cache prelocking Section 0 address configuration register
 */
typedef union {
    struct {
        /** l1_cache_prelock_sct0_addr : R/W; bitpos: [31:0]; default: 0;
         *  Configures the starting virtual address of Section 0 for prelocking in the L1
         *  cache. This field should be configured together with
         *  CACHE_L1_CACHE_PRELOCK_SCT0_SIZE.
         */
        uint32_t l1_cache_prelock_sct0_addr:32;
    };
    uint32_t val;
} cache_l1_cache_prelock_sct0_addr_reg_t;

/** Type of l1_cache_prelock_sct1_addr register
 *  L1 cache prelocking Section 1 address configuration register
 */
typedef union {
    struct {
        /** l1_cache_prelock_sct1_addr : R/W; bitpos: [31:0]; default: 0;
         *  Configures the starting virtual address of Section 1 for prelocking in the L1
         *  cache. This field should be configured together with
         *  CACHE_L1_CACHE_PRELOCK_SCT1_SIZE.
         */
        uint32_t l1_cache_prelock_sct1_addr:32;
    };
    uint32_t val;
} cache_l1_cache_prelock_sct1_addr_reg_t;

/** Type of l1_cache_prelock_sct_size register
 *  L1 cache prelocking section size configuration register
 */
typedef union {
    struct {
        /** l1_cache_prelock_sct0_size : R/W; bitpos: [13:0]; default: 16383;
         *  Configures the size of Section 0 for prelocking in the L1 cache. This field should
         *  be configured together with CACHE_L1_CACHE_PRELOCK_SCT0_ADDR_REG.
         */
        uint32_t l1_cache_prelock_sct0_size:14;
        uint32_t reserved_14:2;
        /** l1_cache_prelock_sct1_size : R/W; bitpos: [29:16]; default: 16383;
         *  Configures the size of Section 1 for prelocking in the L1 cache. This field should
         *  be configured together with CACHE_L1_CACHE_PRELOCK_SCT1_ADDR_REG.
         */
        uint32_t l1_cache_prelock_sct1_size:14;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} cache_l1_cache_prelock_sct_size_reg_t;


/** Group: Cache Locking Control Registers */
/** Type of lock_ctrl register
 *  Locking operation control register
 */
typedef union {
    struct {
        /** lock_ena : R/W/SC; bitpos: [0]; default: 0;
         *  Configures whether to enable lock operation. It will be cleared by hardware after
         *  the locking operation is done.
         *  0: Disable
         *  1: Enable
         */
        uint32_t lock_ena:1;
        /** unlock_ena : R/W/SC; bitpos: [1]; default: 0;
         *  Configures whether to enable unlock operation. It will be cleared by hardware after
         *  the unlocking operation is done.
         *  0: Disable
         *  1: Enable
         */
        uint32_t unlock_ena:1;
        /** lock_done : RO; bitpos: [2]; default: 1;
         *  Represents whether the unlocking or the locking operation is finished.
         *  0: Not finished
         *  1: Finished
         */
        uint32_t lock_done:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} cache_lock_ctrl_reg_t;

/** Type of lock_map register
 *  Locking map configuration register
 */
typedef union {
    struct {
        /** lock_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures which level of cache in the two-level cache structure to perform the
         *  locking or the unlocking operation.
         *  Bit 4: Write 1 to this bit to select the L1 cache
         *  Other bits: reserved
         */
        uint32_t lock_map:6;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} cache_lock_map_reg_t;

/** Type of lock_addr register
 *  Locking address configuration register
 */
typedef union {
    struct {
        /** lock_addr : R/W; bitpos: [31:0]; default: 0;
         *  Configures the starting virtual address for the locking or unlocking operation.
         *  This field should be configured together with CACHE_LOCK_SIZE_REG.
         */
        uint32_t lock_addr:32;
    };
    uint32_t val;
} cache_lock_addr_reg_t;

/** Type of lock_size register
 *  Locking size configuration register
 */
typedef union {
    struct {
        /** lock_size : R/W; bitpos: [15:0]; default: 0;
         *  Configures the size for the locking or unlocking operation. This field should be
         *  configured together with CACHE_LOCK_ADDR_REG.
         */
        uint32_t lock_size:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} cache_lock_size_reg_t;


/** Group: Cache Sync Control Registers */
/** Type of sync_ctrl register
 *  Sync operation control register
 */
typedef union {
    struct {
        /** invalidate_ena : R/W; bitpos: [0]; default: 1;
         *  Configures whether to enable the invalidatation operation. It will be cleared by
         *  hardware after the operation is done.
         *  0: Disable
         *  1: Enable
         */
        uint32_t invalidate_ena:1;
        uint32_t reserved_1:3;
        /** sync_done : RO; bitpos: [4]; default: 0;
         *  Represents whether the synchronization operation is finished.
         *  0: Not finished
         *  1: Finished
         */
        uint32_t sync_done:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} cache_sync_ctrl_reg_t;

/** Type of sync_map register
 *  Sync map configuration register
 */
typedef union {
    struct {
        /** sync_map : R/W; bitpos: [5:0]; default: 31;
         *  Configures which caches in the two-level cache structure will apply the sync
         *  operation.
         *  Bit 4: Write 1 to this bit to select the L1 cache
         *  Other bits: Reserved
         */
        uint32_t sync_map:6;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} cache_sync_map_reg_t;

/** Type of sync_addr register
 *  Sync address configuration register
 */
typedef union {
    struct {
        /** sync_addr : R/W; bitpos: [31:0]; default: 0;
         *  Configures the starting virtual address for the synchronization operation. This
         *  field should be configured together with CACHE_SYNC_SIZE_REG.
         */
        uint32_t sync_addr:32;
    };
    uint32_t val;
} cache_sync_addr_reg_t;

