espressif/esp-idf/components/soc/esp32h21/register/soc/cache_struct.h
/** Type of sync_size register
 *  Sync size configuration register
 */
typedef union {
    struct {
        /** sync_size : R/W; bitpos: [23:0]; default: 0;
         *  Configures the size for the synchronization operation. This field should be
         *  configured together with CACHE_SYNC_ADDR_REG.
         */
        uint32_t sync_size:24;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} cache_sync_size_reg_t;


/** Group: Preload Control and configuration registers */
/** Type of l1_cache_preload_ctrl register
 *  L1 cache preloading operation control register
 */
typedef union {
    struct {
        /** l1_cache_preload_ena : R/W/SC; bitpos: [0]; default: 0;
         *  Configures whether to enable the preloading operation in the L1 cache. It will be
         *  cleared by hardware automatically after the preloading operation is done.
         *  0: Disable
         *  1: Enable
         */
        uint32_t l1_cache_preload_ena:1;
        /** l1_cache_preload_done : RO; bitpos: [1]; default: 1;
         *  Represents whether the preloading operation is finished.
         *  0: Not finished
         *  1: Finished
         */
        uint32_t l1_cache_preload_done:1;
        /** l1_cache_preload_order : R/W; bitpos: [2]; default: 0;
         *  Configures the direction of the preloading operation.
         *  0: Ascending
         *  1: Descending
         */
        uint32_t l1_cache_preload_order:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} cache_l1_cache_preload_ctrl_reg_t;

/** Type of l1_cache_preload_addr register
 *  L1 cache preloading address configuration register
 */
typedef union {
    struct {
        /** l1_cache_preload_addr : R/W; bitpos: [31:0]; default: 0;
         *  Configures the starting virtual address for the preloading operation in the L1
         *  cache. This field should be configured together with
         *  CACHE_L1_CACHE_PRELOAD_SIZE_REG.
         */
        uint32_t l1_cache_preload_addr:32;
    };
    uint32_t val;
} cache_l1_cache_preload_addr_reg_t;

/** Type of l1_cache_preload_size register
 *  L1 cache preloading size configuration register
 */
typedef union {
    struct {
        /** l1_cache_preload_size : R/W; bitpos: [23:0]; default: 0;
         *  Configures the size of Section 0 for the preloading operation in the L1 cache. This
         *  field should be configured together with CACHE_L1_CACHE_PRELOAD_ADDR_REG.
         */
        uint32_t l1_cache_preload_size:24;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} cache_l1_cache_preload_size_reg_t;


/** Group: Autoload Control and configuration registers */
/** Type of l1_cache_autoload_ctrl register
 *  L1 cache autoloading operation control register
 */
typedef union {
    struct {
        /** l1_cache_autoload_ena : R/W; bitpos: [0]; default: 0;
         *  Configures whether to enable the autoloading operation in the L1 cache.
         *  0: Disable
         *  1: Enable
         */
        uint32_t l1_cache_autoload_ena:1;
        /** l1_cache_autoload_done : RO; bitpos: [1]; default: 1;
         *  Represents whether the autoloading operation in the L1 cache is finished.
         *  0: Not finished
         *  1: Finished
         */
        uint32_t l1_cache_autoload_done:1;
        /** l1_cache_autoload_order : R/W; bitpos: [2]; default: 0;
         *  Configures the direction of the autoloading operation in the L1 cache.
         *  0: Ascending
         *  1: Descending
         */
        uint32_t l1_cache_autoload_order:1;
        /** l1_cache_autoload_trigger_mode : R/W; bitpos: [4:3]; default: 0;
         *  Configures the trigger mode of the autoloading operation in the L1 cache.
         *  0/3: Triggered by misses
         *  1: Triggered by hits
         *  2: Triggered by misses or hits
         */
        uint32_t l1_cache_autoload_trigger_mode:2;
        uint32_t reserved_5:3;
        /** l1_cache_autoload_sct0_ena : R/W; bitpos: [8]; default: 0;
         *  Configures whether to enable Section 0 for the autoloading operation in the L1
         *  cache.
         *  0: Disable
         *  1: Enable
         */
        uint32_t l1_cache_autoload_sct0_ena:1;
        /** l1_cache_autoload_sct1_ena : R/W; bitpos: [9]; default: 0;
         *  Configures whether to enable Section 1 for the autoloading operation in the L1
         *  cache.
         *  0: Disable
         *  1: Enable
         */
        uint32_t l1_cache_autoload_sct1_ena:1;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} cache_l1_cache_autoload_ctrl_reg_t;

/** Type of l1_cache_autoload_sct0_addr register
 *  L1 cache autoloading Section 0 address configuration register
 */
typedef union {
    struct {
        /** l1_cache_autoload_sct0_addr : R/W; bitpos: [31:0]; default: 0;
         *  Configures the starting virtual address of Section 0 for the autoloading operation
         *  in the L1 cache. Note that it should be used together with
         *  CACHE_L1_CACHE_AUTOLOAD_SCT0_SIZE and CACHE_L1_CACHE_AUTOLOAD_SCT0_ENA.
         */
        uint32_t l1_cache_autoload_sct0_addr:32;
    };
    uint32_t val;
} cache_l1_cache_autoload_sct0_addr_reg_t;

/** Type of l1_cache_autoload_sct0_size register
 *  L1 cache autoloading Section 0 size configuration register
 */
typedef union {
    struct {
        /** l1_cache_autoload_sct0_size : R/W; bitpos: [23:0]; default: 0;
         *  Configures the size of Section 0 for the autoloading operation in the L1 cache.
         *  Note that it should be used together with CACHE_L1_CACHE_AUTOLOAD_SCT0_ADDR and
         *  CACHE_L1_CACHE_AUTOLOAD_SCT0_ENA.
         */
        uint32_t l1_cache_autoload_sct0_size:24;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} cache_l1_cache_autoload_sct0_size_reg_t;

/** Type of l1_cache_autoload_sct1_addr register
 *  L1 cache autoloading Section 1 address configuration register
 */
typedef union {
    struct {
        /** l1_cache_autoload_sct1_addr : R/W; bitpos: [31:0]; default: 0;
         *  Configures the starting virtual address of Section 1 for the autoloading operation
         *  in the L1 cache. Note that it should be used together with
         *  CACHE_L1_CACHE_AUTOLOAD_SCT1_SIZE and CACHE_L1_CACHE_AUTOLOAD_SCT1_ENA.
         */
        uint32_t l1_cache_autoload_sct1_addr:32;
    };
    uint32_t val;
} cache_l1_cache_autoload_sct1_addr_reg_t;

/** Type of l1_cache_autoload_sct1_size register
 *  L1 cache autoloading Section 1 size configuration register
 */
typedef union {
    struct {
        /** l1_cache_autoload_sct1_size : R/W; bitpos: [23:0]; default: 0;
         *  Configures the size of Section 1 for the autoloading operation in the L1 cache.
         *  Note that it should be used together with CACHE_L1_CACHE_AUTOLOAD_SCT1_ADDR and
         *  CACHE_L1_CACHE_AUTOLOAD_SCT1_ENA.
         */
        uint32_t l1_cache_autoload_sct1_size:24;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} cache_l1_cache_autoload_sct1_size_reg_t;


/** Group: Interrupt Registers */
/** Type of l1_cache_acs_cnt_int_ena register
 *  Cache access counter interrupt enable register
 */
typedef union {
    struct {
        uint32_t reserved_0:4;
        /** l1_bus0_ovf_int_ena : R/W; bitpos: [4]; default: 0;
         *  Write 1 to enable L1_BUS0_OVF_INT.
         */
        uint32_t l1_bus0_ovf_int_ena:1;
        /** l1_bus1_ovf_int_ena : R/W; bitpos: [5]; default: 0;
         *  Write 1 to enable L1_BUS1_OVF_INT.
         */
        uint32_t l1_bus1_ovf_int_ena:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} cache_l1_cache_acs_cnt_int_ena_reg_t;

/** Type of l1_cache_acs_cnt_int_clr register
 *  Cache access counter interrupt clear register
 */
typedef union {
    struct {
        uint32_t reserved_0:4;
        /** l1_bus0_ovf_int_clr : WT; bitpos: [4]; default: 0;
         *  Write 1 to clear L1_BUS0_OVF_INT.
         */
        uint32_t l1_bus0_ovf_int_clr:1;
        /** l1_bus1_ovf_int_clr : WT; bitpos: [5]; default: 0;
         *  Write 1 to clear L1_BUS1_OVF_INT.
         */
        uint32_t l1_bus1_ovf_int_clr:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} cache_l1_cache_acs_cnt_int_clr_reg_t;

/** Type of l1_cache_acs_cnt_int_raw register
 *  Cache access counter interrupt raw register
 */
typedef union {
    struct {
        uint32_t reserved_0:4;
        /** l1_bus0_ovf_int_raw : R/WTC/SS; bitpos: [4]; default: 0;
         *  The raw interrupt status of L1_BUS0_OVF_INT.
         */
        uint32_t l1_bus0_ovf_int_raw:1;
        /** l1_bus1_ovf_int_raw : R/WTC/SS; bitpos: [5]; default: 0;
         *  The raw interrupt status of L1_BUS1_OVF_INT.
         */
        uint32_t l1_bus1_ovf_int_raw:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} cache_l1_cache_acs_cnt_int_raw_reg_t;

/** Type of l1_cache_acs_cnt_int_st register
 *  Cache access counter interrupt status register
 */
typedef union {
    struct {
        uint32_t reserved_0:4;
        /** l1_bus0_ovf_int_st : RO; bitpos: [4]; default: 0;
         *  The masked interrupt status of L1_BUS0_OVF_INT.
         */
        uint32_t l1_bus0_ovf_int_st:1;
        /** l1_bus1_ovf_int_st : RO; bitpos: [5]; default: 0;
         *  The masked interrupt status of L1_BUS1_OVF_INT.
         */
        uint32_t l1_bus1_ovf_int_st:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} cache_l1_cache_acs_cnt_int_st_reg_t;

