espressif/esp-idf/components/soc/esp32h21/register/soc/cache_struct.h
/** Type of l1_cache_acs_fail_ctrl register
 *  Cache access failure mode configuration register
 */
typedef union {
    struct {
        uint32_t reserved_0:4;
        /** l1_cache_acs_fail_check_mode : R/W; bitpos: [4]; default: 0;
         *  Configures whether to propagate the error that occurs during access to lower-level
         *  memory to higher-level access.
         *  0: Not propagate
         *  1: Propagate
         */
        uint32_t l1_cache_acs_fail_check_mode:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} cache_l1_cache_acs_fail_ctrl_reg_t;

/** Type of l1_cache_acs_fail_int_ena register
 *  Cache access failed interrupt enable register
 */
typedef union {
    struct {
        uint32_t reserved_0:4;
        /** l1_cache_fail_int_ena : R/W; bitpos: [4]; default: 0;
         *  Write 1 to enable L1_CACHE_FAIL_INT.
         */
        uint32_t l1_cache_fail_int_ena:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} cache_l1_cache_acs_fail_int_ena_reg_t;

/** Type of l1_cache_acs_fail_int_clr register
 *  L1 cache access failed interrupt clear register
 */
typedef union {
    struct {
        uint32_t reserved_0:4;
        /** l1_cache_fail_int_clr : WT; bitpos: [4]; default: 0;
         *  Write 1 to clear L1_CACHE_FAIL_INT.
         */
        uint32_t l1_cache_fail_int_clr:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} cache_l1_cache_acs_fail_int_clr_reg_t;

/** Type of l1_cache_acs_fail_int_raw register
 *  Cache access failed interrupt raw register
 */
typedef union {
    struct {
        uint32_t reserved_0:4;
        /** l1_cache_fail_int_raw : R/WTC/SS; bitpos: [4]; default: 0;
         *  The raw interrupt status of L1_CACHE_FAIL_INT.
         */
        uint32_t l1_cache_fail_int_raw:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} cache_l1_cache_acs_fail_int_raw_reg_t;

/** Type of l1_cache_acs_fail_int_st register
 *  Cache access failed interrupt status register
 */
typedef union {
    struct {
        uint32_t reserved_0:4;
        /** l1_cache_fail_int_st : RO; bitpos: [4]; default: 0;
         *  The masked interrupt status of L1_CACHE_FAIL_INT.
         */
        uint32_t l1_cache_fail_int_st:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} cache_l1_cache_acs_fail_int_st_reg_t;

/** Type of l1_cache_sync_preload_int_ena register
 *  Sync and preloading operation interrupt enable register
 */
typedef union {
    struct {
        uint32_t reserved_0:4;
        /** l1_cache_pld_done_int_ena : R/W; bitpos: [4]; default: 0;
         *  Write 1 to enable L1_CACHE_PLD_DONE_INT.
         */
        uint32_t l1_cache_pld_done_int_ena:1;
        uint32_t reserved_5:1;
        /** sync_done_int_ena : R/W; bitpos: [6]; default: 0;
         *  Write 1 to enable CACHE_SYNC_DONE_INT.
         */
        uint32_t sync_done_int_ena:1;
        uint32_t reserved_7:4;
        /** l1_cache_pld_err_int_ena : R/W; bitpos: [11]; default: 0;
         *  Write 1 to enable CACHE_PLD_ERR_INT.
         */
        uint32_t l1_cache_pld_err_int_ena:1;
        uint32_t reserved_12:1;
        /** sync_err_int_ena : R/W; bitpos: [13]; default: 0;
         *  Write 1 to enable CACHE_SYNC_ERR_INT.
         */
        uint32_t sync_err_int_ena:1;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} cache_l1_cache_sync_preload_int_ena_reg_t;

/** Type of l1_cache_sync_preload_int_clr register
 *  Sync and preloading operation interrupt clear register
 */
typedef union {
    struct {
        uint32_t reserved_0:4;
        /** l1_cache_pld_done_int_clr : WT; bitpos: [4]; default: 0;
         *  Write 1 to clear L1_CACHE_PLD_DONE_INT.
         */
        uint32_t l1_cache_pld_done_int_clr:1;
        uint32_t reserved_5:1;
        /** sync_done_int_clr : WT; bitpos: [6]; default: 0;
         *  Write 1 to clear CACHE_SYNC_DONE_INT.
         */
        uint32_t sync_done_int_clr:1;
        uint32_t reserved_7:4;
        /** l1_cache_pld_err_int_clr : WT; bitpos: [11]; default: 0;
         *  Write 1 to clear L1_CACHE_PLD_ERR_INT.
         */
        uint32_t l1_cache_pld_err_int_clr:1;
        uint32_t reserved_12:1;
        /** sync_err_int_clr : WT; bitpos: [13]; default: 0;
         *  Write 1 to clear CACHE_SYNC_ERR_INT.
         */
        uint32_t sync_err_int_clr:1;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} cache_l1_cache_sync_preload_int_clr_reg_t;

/** Type of l1_cache_sync_preload_int_raw register
 *  Sync and preloading operation interrupt raw register
 */
typedef union {
    struct {
        uint32_t reserved_0:4;
        /** l1_cache_pld_done_int_raw : R/WTC/SS; bitpos: [4]; default: 0;
         *  The raw interrupt status of L1_CACHE_PLD_DONE_INT.
         */
        uint32_t l1_cache_pld_done_int_raw:1;
        uint32_t reserved_5:1;
        /** sync_done_int_raw : R/WTC/SS; bitpos: [6]; default: 0;
         *  The raw interrupt status of CACHE_SYNC_DONE_INT.
         */
        uint32_t sync_done_int_raw:1;
        uint32_t reserved_7:4;
        /** l1_cache_pld_err_int_raw : R/WTC/SS; bitpos: [11]; default: 0;
         *  The raw interrupt status of L1_CACHE_PLD_ERR_INT.
         */
        uint32_t l1_cache_pld_err_int_raw:1;
        uint32_t reserved_12:1;
        /** sync_err_int_raw : R/WTC/SS; bitpos: [13]; default: 0;
         *  The raw interrupt status of CACHE_SYNC_ERR_INT.
         */
        uint32_t sync_err_int_raw:1;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} cache_l1_cache_sync_preload_int_raw_reg_t;

/** Type of l1_cache_sync_preload_int_st register
 *  Sync and preloading operation interrupt status register
 */
typedef union {
    struct {
        uint32_t reserved_0:4;
        /** l1_cache_pld_done_int_st : RO; bitpos: [4]; default: 0;
         *  The masked interrupt status of L1_CACHE_PLD_DONE_INT.
         */
        uint32_t l1_cache_pld_done_int_st:1;
        uint32_t reserved_5:1;
        /** sync_done_int_st : RO; bitpos: [6]; default: 0;
         *  The masked interrupt status of CACHE_SYNC_DONE_INT.
         */
        uint32_t sync_done_int_st:1;
        uint32_t reserved_7:4;
        /** l1_cache_pld_err_int_st : RO; bitpos: [11]; default: 0;
         *  The masked interrupt status of L1_CACHE_PLD_ERR_INT.
         */
        uint32_t l1_cache_pld_err_int_st:1;
        uint32_t reserved_12:1;
        /** sync_err_int_st : RO; bitpos: [13]; default: 0;
         *  The masked interrupt status of CACHE_SYNC_ERR_INT.
         */
        uint32_t sync_err_int_st:1;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} cache_l1_cache_sync_preload_int_st_reg_t;


/** Group: Cache Performance Counters Registers */
/** Type of l1_cache_acs_cnt_ctrl register
 *  Cache access counter enable and clear register
 */
typedef union {
    struct {
        uint32_t reserved_0:4;
        /** l1_bus0_cnt_ena : R/W; bitpos: [4]; default: 0;
         *  Configures whether to enable the BUS0 counters in the L1 cache.
         *  0: Disable
         *  1: Enable
         */
        uint32_t l1_bus0_cnt_ena:1;
        /** l1_bus1_cnt_ena : R/W; bitpos: [5]; default: 0;
         *  Configures whether to enable the BUS1 counters in the L1 cache.
         *  0: Disable
         *  1: Enable
         */
        uint32_t l1_bus1_cnt_ena:1;
        uint32_t reserved_6:14;
        /** l1_bus0_cnt_clr : WT; bitpos: [20]; default: 0;
         *  Configures whether to clear the BUS0 counters in the L1 cache.
         *  0: Not clear
         *  1: Clear
         */
        uint32_t l1_bus0_cnt_clr:1;
        /** l1_bus1_cnt_clr : WT; bitpos: [21]; default: 0;
         *  Configures whether to clear the BUS1 counters in the L1 cache.
         *  0: Not clear
         *  1: Clear
         */
        uint32_t l1_bus1_cnt_clr:1;
        uint32_t reserved_22:10;
    };
    uint32_t val;
} cache_l1_cache_acs_cnt_ctrl_reg_t;


/** Group: Access Statistics registers */
/** Type of l1_bus0_acs_hit_cnt register
 *  L1 cache BUS1 hit-access counter register
 */
typedef union {
    struct {
        /** l1_bus0_hit_cnt : RO; bitpos: [31:0]; default: 0;
         *  Represents the number of hits when BUS0 accesses the L1 cache.
         */
        uint32_t l1_bus0_hit_cnt:32;
    };
    uint32_t val;
} cache_l1_bus0_acs_hit_cnt_reg_t;

/** Type of l1_bus0_acs_miss_cnt register
 *  L1 cache BUS0 missed-access counter register
 */
typedef union {
    struct {
        /** l1_bus0_miss_cnt : RO; bitpos: [31:0]; default: 0;
         *  Represents the number of misses when BUS0 accesses the L1 cache.
         */
        uint32_t l1_bus0_miss_cnt:32;
    };
    uint32_t val;
} cache_l1_bus0_acs_miss_cnt_reg_t;

/** Type of l1_bus0_acs_conflict_cnt register
 *  L1 cache BUS0 conflicting-access counter register
 */
typedef union {
    struct {
        /** l1_bus0_conflict_cnt : RO; bitpos: [31:0]; default: 0;
         *  Represents the number of access conflicts when BUS0 accesses the L1 cache.
         */
        uint32_t l1_bus0_conflict_cnt:32;
    };
    uint32_t val;
} cache_l1_bus0_acs_conflict_cnt_reg_t;

