espressif/esp-idf/components/soc/esp32h21/register/soc/cache_struct.h
/** Type of l1_bus0_acs_nxtlvl_rd_cnt register
 *  L1 cache BUS0 next-level-access counter register
 */
typedef union {
    struct {
        /** l1_bus0_nxtlvl_rd_cnt : RO; bitpos: [31:0]; default: 0;
         *  Represents the number of times the L1 cache accesses the next-level module due to
         *  BUS0 access.
         */
        uint32_t l1_bus0_nxtlvl_rd_cnt:32;
    };
    uint32_t val;
} cache_l1_bus0_acs_nxtlvl_rd_cnt_reg_t;

/** Type of l1_bus1_acs_hit_cnt register
 *  L1 cache BUS1 hit-access counter register
 */
typedef union {
    struct {
        /** l1_bus1_hit_cnt : RO; bitpos: [31:0]; default: 0;
         *  Represents the number of hits when BUS1 accesses the L1 cache.
         */
        uint32_t l1_bus1_hit_cnt:32;
    };
    uint32_t val;
} cache_l1_bus1_acs_hit_cnt_reg_t;

/** Type of l1_bus1_acs_miss_cnt register
 *  L1 cache BUS1 missed-access counter register
 */
typedef union {
    struct {
        /** l1_bus1_miss_cnt : RO; bitpos: [31:0]; default: 0;
         *  Represents the number of misses when BUS1 accesses the L1 cache.
         */
        uint32_t l1_bus1_miss_cnt:32;
    };
    uint32_t val;
} cache_l1_bus1_acs_miss_cnt_reg_t;

/** Type of l1_bus1_acs_conflict_cnt register
 *  L1 cache BUS1 conflicting-access counter register
 */
typedef union {
    struct {
        /** l1_bus1_conflict_cnt : RO; bitpos: [31:0]; default: 0;
         *  Represents the number of access conflicts when BUS1 accesses the L1 cache.
         */
        uint32_t l1_bus1_conflict_cnt:32;
    };
    uint32_t val;
} cache_l1_bus1_acs_conflict_cnt_reg_t;

/** Type of l1_bus1_acs_nxtlvl_rd_cnt register
 *  L1 cache BUS1 next-level-access counter register
 */
typedef union {
    struct {
        /** l1_bus1_nxtlvl_rd_cnt : RO; bitpos: [31:0]; default: 0;
         *  Indicates the number of times the L1 cache accesses the next-level module due to
         *  BUS1 access.
         */
        uint32_t l1_bus1_nxtlvl_rd_cnt:32;
    };
    uint32_t val;
} cache_l1_bus1_acs_nxtlvl_rd_cnt_reg_t;

/** Type of l1_bus1_acs_nxtlvl_wr_cnt register
 *  L1-Cache bus1 WB-Access Counter register
 */
typedef union {
    struct {
        /** l1_bus1_nxtlvl_wr_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of write back when bus1 accesses L1-Cache.
         */
        uint32_t l1_bus1_nxtlvl_wr_cnt:32;
    };
    uint32_t val;
} cache_l1_bus1_acs_nxtlvl_wr_cnt_reg_t;


/** Group: Access Fail Debug registers */
/** Type of l1_cache_acs_fail_id_attr register
 *  L1-Cache Access Fail ID/attribution information register
 */
typedef union {
    struct {
        /** l1_cache_fail_id : RO; bitpos: [15:0]; default: 0;
         *  Represents the ID of the failed access to the L1 cache.
         *  Bit 4: BUS0
         *  Bit 5: BUS1
         *  Others: reserved
         */
        uint32_t l1_cache_fail_id:16;
        /** l1_cache_fail_attr : RO; bitpos: [31:16]; default: 0;
         *  Represents the attribute of the failed access to the L1 cache.
         *  Bit 0: Fetching instructions
         *  Bit 1: Reading data
         *  Bit 7: non-cacheable
         *  Others: reserved
         */
        uint32_t l1_cache_fail_attr:16;
    };
    uint32_t val;
} cache_l1_cache_acs_fail_id_attr_reg_t;

/** Type of l1_cache_acs_fail_addr register
 *  L1 cache access failed address information register
 */
typedef union {
    struct {
        /** l1_cache_fail_addr : RO; bitpos: [31:0]; default: 0;
         *  Represents the address of the failed access to the L1 cache.
         */
        uint32_t l1_cache_fail_addr:32;
    };
    uint32_t val;
} cache_l1_cache_acs_fail_addr_reg_t;


/** Group: Cache Trace Registers */
/** Type of l1_cache_sync_preload_exception register
 *  Cache sync and preloading operation exception register
 */
typedef union {
    struct {
        uint32_t reserved_0:8;
        /** l1_cache_pld_err_code : RO; bitpos: [9:8]; default: 0;
         *  Represents the error code for the failed preloading operation.
         *  2: The preloading size in the L1 cache is wrong
         *  Other values: reserved
         */
        uint32_t l1_cache_pld_err_code:2;
        uint32_t reserved_10:2;
        /** sync_err_code : RO; bitpos: [13:12]; default: 0;
         *  Represents the error code for the failed synchronization operation.
         *  0: Incorrect synchronization map
         *  1: Synchronization command conflict
         *  2: Incorrect synchronization size
         *  3: Reserved
         */
        uint32_t sync_err_code:2;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} cache_l1_cache_sync_preload_exception_reg_t;


/** Group: Cache Operation Reset Registers */
/** Type of l1_cache_sync_rst_ctrl register
 *  Cache sync reset control register
 */
typedef union {
    struct {
        uint32_t reserved_0:4;
        /** l1_cache_sync_rst : R/W; bitpos: [4]; default: 0;
         *  Configures whether to reset the synchronization logic inside the L1 cache.
         *  0: Not reset
         *  1: Reset
         *  It is recommended that this field should only be used when a fatal error of the
         *  synchronization logic occurs.
         */
        uint32_t l1_cache_sync_rst:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} cache_l1_cache_sync_rst_ctrl_reg_t;

/** Type of l1_cache_preload_rst_ctrl register
 *  Cache preloading reset control register
 */
typedef union {
    struct {
        uint32_t reserved_0:4;
        /** l1_cache_pld_rst : R/W; bitpos: [4]; default: 0;
         *  Configures whether to reset the preloading logic inside the L1 cache.
         *  0: Not reset
         *  1: Reset
         *  It is recommended that this field should only be used when a fatal error of the
         *  preloading logic occurs.
         */
        uint32_t l1_cache_pld_rst:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} cache_l1_cache_preload_rst_ctrl_reg_t;


/** Group: Autoloading Buffer Clear Control Register */
/** Type of l1_cache_autoload_buf_clr_ctrl register
 *  Cache autoloading buffer clear control register
 */
typedef union {
    struct {
        uint32_t reserved_0:4;
        /** l1_cache_ald_buf_clr : R/W; bitpos: [4]; default: 0;
         *  Configures whether to clear the autoloading buffer inside the L1 cache.
         *  0: Not clear the buffer. Recommended when autoloading of L1 cache is used.
         *  1: Clear the buffer. Once set, autoloading of L1 cache will stop working.
         */
        uint32_t l1_cache_ald_buf_clr:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} cache_l1_cache_autoload_buf_clr_ctrl_reg_t;


/** Group: Tag and Data Memory Access Control Registers */
/** Type of l1_cache_object_ctrl register
 *  Cache tag and data memory object control register
 */
typedef union {
    struct {
        uint32_t reserved_0:4;
        /** l1_cache_tag_object : R/W; bitpos: [4]; default: 0;
         *  Configures whether to set the L1 cache tag memory as an object.
         *  0: Not set
         *  1: Set
         *  This field should be one-hot with the other fields inside this register.
         */
        uint32_t l1_cache_tag_object:1;
        uint32_t reserved_5:5;
        /** l1_cache_mem_object : R/W; bitpos: [10]; default: 0;
         *  Configures whether to set the L1 cache data memory as an object.
         *  0: Not set
         *  1: Set
         *  This field should be one-hot with the other fields inside this register.
         */
        uint32_t l1_cache_mem_object:1;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} cache_l1_cache_object_ctrl_reg_t;

/** Type of l1_cache_way_object register
 *  Cache tag and data memory way register
 */
typedef union {
    struct {
        /** l1_cache_way_object : R/W; bitpos: [2:0]; default: 0;
         *  Configures which way in the tag memory or the data memory to access.
         *  0: Way 0
         *  1: Way 1
         */
        uint32_t l1_cache_way_object:3;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} cache_l1_cache_way_object_reg_t;

